/// 곤충 분류 인덱스를 이름으로 매핑
class InsectLabels {
  static const Map<int, String> labels = {
    0: "개미",
    1: "귀뚜라미",
    2: "그리마",
    3: "꽃매미",
    4: "나방",
    5: "나비",
    6: "노린재",
    7: "대벌레",
    8: "딱정벌레",
    9: "매미",
    10: "먼지벌레",
    11: "메뚜기",
    12: "모기",
    13: "무당벌레",
    14: "물장군",
    15: "바퀴벌레",
    16: "반딧불이",
    17: "방아깨비",
    18: "벌",
    19: "사마귀",
    20: "사슴벌레",
    21: "소금쟁이",
    22: "쇠똥구리",
    23: "여치",
    24: "잠자리",
    25: "장수말벌",
    26: "장수풍뎅이",
    27: "좀벌레",
    28: "지네",
    29: "집게벌레",
    30: "파리",
    31: "풍뎅이",
    32: "하늘소",
    33: "하루살이",
    34: "화상벌레",
  };

  static String getName(int index) {
    return labels[index] ?? "Unknown";
  }
}
