const List<String> adjectives = [
  '파란', '빨간', '노란', '하얀', '검은', '작은', '큰', '빠른', '느린', '귀여운',
  '용감한', '엉뚱한', '행복한', '슬픈', '명랑한', '씩씩한', '졸린', '웃긴', '기쁜', '똑똑한',
  '영리한', '멋진', '튼튼한', '조용한', '수줍은', '빛나는', '반짝이는', '무서운', '강한', '부지런한',
  '정직한', '깨끗한', '더러운', '재빠른', '재미있는', '웃는', '엉성한', '신나는', '자유로운', '날쌘',
  '얌전한', '차분한', '배고픈', '이상한', '희한한', '위대한', '선한', '악한', '근엄한', '은은한',
  '푸른', '초록', '주황', '자주', '보라', '분홍', '은빛', '금빛', '철의', '가벼운',
  '무거운', '축축한', '건조한', '시원한', '따뜻한', '뜨거운', '차가운', '말랑한', '딱딱한', '끈적한',
  '부드러운', '매끄러운', '거친', '기름진', '매운', '단', '짠', '쓴', '신', '졸린',
  '반듯한', '구불한', '둥근', '각진', '깜찍한', '졸졸거리는', '바쁜', '소중한', '그리운', '놀라운',
  '반가운', '친절한', '예쁜', '잘생긴', '귀찮은', '열정적인', '성실한', '겸손한', '이기적인', '다정한',
];

const List<String> insects = [
  '무당벌레', '사슴벌레', '장수풍뎅이', '나비', '벌', '잠자리', '개미', '메뚜기', '귀뚜라미', '매미',
  '하늘소', '하루살이', '바퀴벌레', '파리', '모기', '노린재', '하늘지네', '흰개미', '물장군', '왕거미',
  '달팽이', '진드기', '벼룩', '벌레왕', '버섯벌레', '줄무늬벌', '뿔벌레', '도마뱀벌레', '왕사마귀', '황소개구리',
  '날도래', '풍뎅이', '가시벌레', '나방', '왕나비', '땃쥐벌레', '왕귀뚜라미', '풍선벌레', '돌개구리', '검은파리',
  '가면벌레', '비단벌레', '박쥐벌레', '허리노린재', '왕노린재', '천둥벌레', '개미귀신', '날치벌레', '황금벌', '호랑나비',
  '참나방', '투구벌레', '긴꼬리벌', '호리병벌', '산누에', '금눈썹벌', '폭탄벌레', '유령벌레', '털복숭이벌', '유리날개나비',
  '작은나방', '밤나방', '날개달린개미', '털진딧물', '산파리', '깨알벌', '푸른거미', '갈색거미', '폭풍나방', '진홍노린재',
  '길쭉한벌', '왕파리', '독나방', '진드기왕', '꽃무당벌레', '세줄노린재', '굴파리', '그물벌레', '반딧불이', '철갑풍뎅이',
  '등딱지벌', '깃털파리', '회색메뚜기', '황사메뚜기', '연두사마귀', '꽃사슴벌레', '눈사람벌레', '얼룩나비', '대왕거미', '황금사슴벌레',
];
// 닉네임 랜덤용 dart 파일 생성